// Напишите программу, которая на вход принимает 2 числа и проверяет,
// является ли первое число квадратом второго.
// a = 25, b = 5
// a = 2 b = 10
// a = 9 b = -3
// a = -3 b - 9

int a=2,b=2;
if(a==b*b)
{
Console.WriteLine("Yes");
}
else
{
Console.WriteLine("No");   
}


