// Напишите программу, которая на вход принимает число и выдает его квадрат
// например -4 = 16
// например -3 = 9
// например -7 = 49

int value = 10;
int result = value * value;
Console.WriteLine($"result: {result}");

